[{"Spec/Specs":"JDWE2302008","Price(AUD)":"$24.00","Product summary":"Geometric Jewelry 18K Real Gold Plated Stainless Steel Simple Round Ball Stud Earring for Women","Product name":"Maroubra Beach Stub","product description":"Elevate your style with our stunning Gold Plated Stud Earrings. These 18K Real Gold Plated Stainless Steel Simple Round Ball Stud Earrings are the perfect addition to any jewelry collection. The minimalist design exudes elegance and modernity, making them ideal for any occasion.\n\nCrafted with precision and attention to detail, these earrings are a must-have for women who appreciate timeless sophistication. The gold plating adds a touch of luxury, while the simple round ball design keeps the look chic and versatile.\n\nWhether you're dressing up for a special event or adding a touch of glamour to your everyday outfits, these earrings are sure to make a statement. The high-quality materials ensure durability and long-lasting shine, so you can enjoy wearing them for years to come.\n\nPair these Gold Plated Stud Earrings with a matching necklace or bracelet for a coordinated look, or mix and match with other pieces from your jewelry collection for a more eclectic style. Whatever your preference, these earrings are sure to become a go-to accessory.\n\nDon't miss out on the opportunity to add these beautiful Gold Plated Stud Earrings to your jewelry collection. Shop now to find the perfect pair for yourself or to gift to a loved one. Elevate your style with timeless sophistication and modern elegance with these stunning earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hecf9473fbc1847f89bf6048c1989f5c9Y.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Mary","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"1.33","Unit price":"USD 0.8900","Total":"USD 5.34","Ready":"Yes"},{"Spec/Specs":"JDB201049","Price(AUD)":"$29.00","Product summary":"Hot Selling 18K Gold Plated Stainless Steel Bracelet Set Miami Cuban Chain Bangle Flat Snake Stacking Bracelet For Women","Product name":"Miami Cuban Stack","product description":"Make a fashion statement with our Hot Selling 18K Gold Plated Stainless Steel Bracelet Set. This set includes the Miami Cuban Chain Bangle and Flat Snake Stacking Bracelet, perfect for stacking up style on your wrist. \n\nCrafted with precision, these bracelets are ideal for women who love bold and eye-catching jewelry. The 18K gold plating adds a touch of luxury to your look, elevating any outfit effortlessly. \n\nThe Miami Cuban Chain Bangle features a classic design that never goes out of style, while the Flat Snake Stacking Bracelet adds a modern twist to your wrist fashion. Wear them together for a layered look or mix and match with other pieces for a personalized style.\n\nWhether you're dressing up for a special occasion or adding a touch of glam to your everyday look, these bracelets are versatile and chic. The high-quality stainless steel ensures durability, so you can enjoy these pieces for years to come.\n\nEmbrace the trend of gold plated jewelry with our stylish bracelet set. Shop now to add a touch of elegance to your jewelry collection. The set also makes a perfect gift for a loved one who appreciates fine jewelry.\n\nDon't miss out on this opportunity to elevate your style with our 18K Gold Plated Stainless Steel Bracelet Set. View our collection today and find the right piece for you.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H716dbd43e5f24629bb58b4635ba4250cc.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.00","Unit price":"USD 1.3400","Total":"USD 8.04","Ready":""},{"Spec/Specs":"JDBW2303023","Price(AUD)":"$35.00","Product summary":"Minimalist 18K Gold Plated Tassel Spine Choker Necklace Stainless Steel Fishbone Chain Necklace Bracelet Women","Product name":"Clovelly Beach Bracelet","product description":"Elevate your wrist game with the stunning Clovelly Beach Bracelet from our Ocean Collection. This stainless steel bracelet features a sleek Fishbone design that exudes understated sophistication. Perfect for adding a touch of elegance to any outfit, this bracelet is a must-have accessory for any occasion.\n\nCrafted from hypoallergenic stainless steel, this bracelet is suitable for even the most sensitive skin. Its waterproof design ensures durability, making it ideal for everyday wear. Say goodbye to nickel and tarnish, as this piece is made to last.\n\nThe minimalist Fishbone design of the Clovelly Beach Bracelet makes it a versatile addition to your jewelry collection. Whether you're heading to the office or a night out with friends, this bracelet will complement any look effortlessly.\n\nLooking for a thoughtful gift? The Clovelly Beach Bracelet is the perfect choice. Its timeless design and high-quality construction make it a memorable gift for a loved one.\n\nDon't miss out on the opportunity to own this exquisite piece of jewelry. Shop the Clovelly Beach Bracelet today and elevate your style to new heights. Add this gold plated bracelet to your collection and experience the beauty of understated elegance.","Product Image":"#REF!","Product image url":"https://s.alicdn.com/@sc04/kf/H11f3a8caa81044039ee7e1c1c345fe8f7.jpg_960x960.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Mary","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"1.55","Unit price":"1.04","Total":"","Ready":"Yes"},{"Spec/Specs":"JDEW2307071","Price(AUD)":"$35.00","Product summary":"J&D Jewelry Summer Stainless Steel Ocean Earring Gift Waterproof Texture Sea Shell Drop Earring for Women","Product name":"Clovelly Beach Shell Earrings","product description":"Elevate your style with the Clovelly Beach Shell Earring, a stunning piece from our Ocean Collection. This exquisite earring features a delicately crafted shell, plated in 18K gold for a touch of luxury. The design captures the essence of Sydney's pristine beaches, making it the perfect accessory for those who love the sea.\n\nNot only is this earring stylish, but it is also functional. Made from stainless steel, it is hypoallergenic, waterproof, and nickel-free, making it suitable for everyday wear. Whether you're heading to the beach or out for a night on the town, this earring is sure to make a statement.\n\nThe Clovelly Beach Shell Earring is part of our gold plated jewelry range, offering a high-quality finish that will last for years to come. The gold plating adds a touch of elegance to the design, making it a versatile piece that can be dressed up or down. Pair it with other pieces from our collection for a coordinated look.\n\nThis earring is the perfect gift for a loved one or a special treat for yourself. With its timeless design and durable construction, it is sure to be a favorite in any jewelry collection. Shop now and add a touch of Sydney's beach vibes to your wardrobe with the Clovelly Beach Shell Earring.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H694937777ab94fe6bc334108de08fc9fZ.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Mary","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"3.01","Unit price":"USD 2.0200","Total":"USD 12.12","Ready":"Yes"},{"Spec/Specs":"JDWE2303025-20","Price(AUD)":"$35.00","Product summary":"Waterproof 18K Gold Plated Stainless Steel Jewelry Big Twist Circle Geometric Hoop Earrings for Women","Product name":"Circle Twist Elegance","product description":"Enhance your style with our Waterproof 18K Gold Plated Stainless Steel Jewelry. The Big Twist Circle Geometric Hoop Earrings for Women are the perfect combination of sophistication and durability. These earrings are not only stylish but also versatile, making them suitable for any occasion.\n\nCrafted with high-quality materials, these earrings feature a contemporary twist on the classic hoop design. The 18K gold plating adds a touch of elegance and luxury to your look. Whether you're dressing up for a special event or adding a chic touch to your everyday outfits, these earrings are sure to make a statement.\n\nThe Big Twist Circle Geometric Hoop Earrings for Women are a must-have accessory for any fashion-forward individual. Their unique design and durable construction ensure that they will last for years to come. Pair them with a matching gold plated necklace or bracelet for a coordinated look that will turn heads wherever you go.\n\nWhether you're shopping for yourself or looking for the perfect gift for a loved one, these earrings are the right choice. With their affordable price and timeless design, they are a great addition to any jewelry collection. Shop now to view our full range of gold plated jewelry and find the perfect pieces to elevate your style.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hd86b20273c914eb49b3a65dd3ca6acb8r.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"4","stock change":"-1 Mary -1 Glebe","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"1.77","Unit price":"USD 1.1900","Total":"USD 7.14","Ready":"Yes"},{"Spec/Specs":"JDE2306038","Price(AUD)":"$39.00","Product summary":"Simple 18K Gold Plated Stainless Steel Jewelry Gift 25mm Waterproof Huggie Hoop Earrings for Women","Product name":"Simple Huggie Gift","product description":"Indulge in the timeless elegance of our Simple Huggie Gift - 18k gold-plated stainless steel jewelry. Crafted with a 25mm waterproof huggie hoop design, these earrings are the perfect balance of simplicity and sophistication. \n\nThe gold plating on these earrings adds a touch of luxury, making them a must-have in every woman's jewelry collection. Durable and versatile, these huggie hoop earrings effortlessly elevate any outfit, whether for a casual day out or a special occasion.\n\nThese earrings make for a perfect gift, symbolizing love and appreciation with their classic and chic design. The 18k gold-plated stainless steel ensures long-lasting wear and shine, giving you a piece of jewelry that will stand the test of time.\n\nThe size of these huggie hoop earrings is just right, making them suitable for everyday wear. The hoop design adds a modern twist to the classic gold-plated jewelry, making them a stylish choice for any fashion-forward individual.\n\nElevate your style effortlessly with our Simple Huggie Gift - 18k gold-plated stainless steel earrings. Shop now to add this perfect gold-plated accessory to your jewelry collection. Experience the beauty and sophistication of these timeless huggie hoop earrings and make a statement with your style.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H238deb3319c5466095e1cc9040393de7P.jpg_100x100.jpg","Total Quantity":"1","Current Quantity":"1","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.44","Unit price":"USD 1.6400","Total":"USD 9.84","Ready":""},{"Spec/Specs":"E453","Price(AUD)":"$39.00","Product summary":"New Korean Real Gold Plated Brass Baroque Freshwater Pearl Earrings","Product name":"Elze's Ethereal Baroque Pearls","product description":"Elevate your look with our stunning Baroque Pearl Delight earrings, a true symbol of luxury and sophistication. Crafted from real gold-plated brass, these earrings are the perfect addition to any outfit, whether you're dressing up for a special occasion or adding a touch of elegance to your everyday look. The freshwater pearls add a touch of opulence, while the Korean-inspired design gives these earrings a unique and modern twist.\n\nThe Baroque Pearl Delight earrings are a perfect example of the fusion of traditional and contemporary styles, making them a must-have accessory for any fashion-forward woman. The timeless design ensures that these earrings will never go out of style, while the chic gold plating adds a touch of glamour to any ensemble. Whether you're a fan of hoop earrings or prefer the classic look of stud earrings, these earrings are sure to become a staple in your jewelry collection.\n\nSurprise a loved one with the gift of Baroque Pearl Delight earrings, the perfect addition to any jewelry lover's collection. With their versatile design and impeccable craftsmanship, these earrings are sure to be a hit with anyone who appreciates fine jewelry. Treat yourself to a pair today and experience the beauty and elegance of these exquisite earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hbe1b0fae0afe48b1bb35116537b4c954v.png_100x100.jpg","Total Quantity":"5","Current Quantity":"4","stock change":"-1 broken","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"2.95","Unit price":"USD 1.9800","Total":"USD 9.90","Ready":""},{"Spec/Specs":"JDWE2302046","Price(AUD)":"$39.00","Product summary":"New Arrival 18K Gold Plated Stainless Steel heart hoop texture Drop Earring","Product name":"Heart Hoop Texture Drops","product description":"Introducing our stunning New Arrival Heart Hoop Texture Drops - 18k gold-plated stainless steel earrings. These earrings feature a unique heart hoop design that adds a touch of modern sophistication to any outfit. The textured drop detail gives these earrings a contemporary edge, making them a versatile and stylish choice for any occasion.\n\nCrafted from high-quality stainless steel and plated with 18k gold, these earrings are not only beautiful but also durable and waterproof. This means you can wear them confidently in any weather without worrying about tarnishing or damage. The gold plating gives them a luxurious and elegant look that will elevate your ensemble effortlessly.\n\nWhether you're dressing up for a special event or adding a chic touch to your everyday look, these Heart Hoop Texture Drops are the perfect accessory. They are perfect for women who want to express their unique sense of style through their jewelry choices. The hoop design adds a trendy touch, while the heart detail adds a touch of romance.\n\nPair these earrings with a matching gold plated necklace or bracelet for a coordinated look, or mix and match with other pieces for a more eclectic style. These earrings are a must-have addition to any jewelry collection, and they also make a great gift for a special someone.\n\nDon't miss out on the opportunity to add these stylish and versatile earrings to your jewelry collection. Shop our New Arrival Heart Hoop Texture Drops today and elevate your look with the perfect gold plated accessory.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hd1cdbb4205194d638274839deaa89dfeE.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.88","Unit price":"USD 1.9300","Total":"USD 11.58","Ready":""},{"Spec/Specs":"JDE201842-BK","Price(AUD)":"$39.00","Product summary":"18k Gold pvd Plated Stainless Steel Earrings Jewelry Black agate Sun Pendant hoop Earrings women","Product name":"Black Agate Sun Hoops","product description":"Elevate your style with our Black Agate Sun Hoops - 18k gold plated earrings. These stunning earrings feature a waterproof design for durability and a unique black agate sun pendant for a touch of luxury. The fusion of classic and contemporary elements makes these earrings perfect for women looking to add sophistication to their ensemble.\n\nCrafted from stainless steel and plated with 18k gold, these earrings are both stylish and versatile, making them a perfect addition to any jewelry collection. The hoop design adds a modern twist to the classic sun pendant, making these earrings suitable for any occasion.\n\nWhether you're dressing up for a special event or simply want to add a touch of elegance to your everyday look, these Black Agate Sun Hoops are the perfect choice. The gold plating adds a luxurious shine to the earrings, making them a standout piece in any outfit.\n\nDon't miss out on the chance to own these beautiful earrings. Shop now and add a touch of sophistication to your jewelry collection. These Black Agate Sun Hoops are the perfect gift for yourself or a loved one, so don't hesitate to treat yourself to something special.\n\nEmbrace sophistication and style with our Black Agate Sun Hoops - the perfect gold plated earrings for any occasion.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H09555f545330492ca191e408d11b4e84H.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Glebe","Unit":"Pieces","collection":"","published":"","Unit price AUD":"3.32","Unit price":"USD 2.2300","Total":"USD 13.38","Ready":""},{"Spec/Specs":"JDE2023014","Price(AUD)":"$39.00","Product summary":"18k Gold Plated Stainless Steel White Natural Shell Heart Shape Lock Design Pendant Earrings","Product name":"Shell Lock Pendant Elegance","product description":"Step into elegance with our Shell Lock Pendant Elegance earrings, the perfect addition to your jewelry collection. These 18k gold-plated stainless steel earrings feature a stunning white natural shell heart shape lock design, adding a touch of sophistication to any outfit.\n\nThe timeless design of these earrings makes them a versatile accessory that can be worn for any occasion. Whether you're dressing up for a special event or simply want to add a touch of elegance to your everyday look, the Shell Lock Pendant Elegance earrings are the perfect choice.\n\nNot only are these earrings stylish, but they are also waterproof, ensuring that they will remain in pristine condition for years to come. This durability makes them a practical and long-lasting investment in your jewelry collection.\n\nIf you appreciate classic and elegant accessories, the Shell Lock Pendant Elegance earrings are a must-have. Their simple yet sophisticated design is sure to elevate your style effortlessly, making them the perfect choice for any woman who values timeless beauty.\n\nAdd a touch of luxury to your look with these exquisite earrings, the perfect choice for those who appreciate high-quality craftsmanship and attention to detail. Shop now and discover the elegance of our Shell Lock Pendant Elegance earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hd566192d50df4c87aa2f28cd92f44ed6e.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"3.10","Unit price":"USD 2.0800","Total":"USD 12.48","Ready":""},{"Spec/Specs":"JDWE2301017","Price(AUD)":"$39.00","Product summary":"Fashion Jewelry Stainless Steel starfish ocean series Hoop Earring for Women or Girls","Product name":"Coogee Beach Hoops","product description":"Experience the beauty of the sea with our Coogee Beach Hoops with Starfish Pendant. These stunning earrings are part of our Ocean Collection, designed to capture the timeless elegance of the ocean. The starfish pendant adds a touch of whimsy to the minimalist design, perfect for adding a touch of nature to your look.\n\nCrafted from stainless steel, these hoops are plated in 18K gold, giving them a luxurious finish that is sure to stand the test of time. The gold plating not only adds a touch of sophistication but also ensures that these earrings are hypoallergenic, waterproof, and nickel-free, making them suitable for even the most sensitive ears.\n\nWhether you're heading to the beach or a night out on the town, these earrings are the perfect accessory. The classic hoop design is versatile and easy to wear, while the starfish pendant adds a unique twist that sets them apart from your average hoop earrings.\n\nThese Coogee Beach Hoops with Starfish Pendant are the perfect addition to your jewelry collection. Whether you're a fan of gold plated jewelry or simply love the beauty of the sea, these earrings are sure to become a staple in your wardrobe. Shop now and add a touch of ocean-inspired elegance to your look.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Ha7ab7584e1dc4f4d89035311f1d7f6eaT.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Glebe","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"2.67","Unit price":"USD 1.7900","Total":"USD 10.74","Ready":"Yes"},{"Spec/Specs":"JDE020385-1","Price(AUD)":"$39.00","Product summary":"Dropshipping Geometric PVD Gold Plated Thick Hoop Earrings Wedding Stainless Steel Wide Chunky CC Hoop Earrings for Women","Product name":"Chunky Charm Hoops","product description":"Make a bold statement with our Dropshipping Geometric PVD Gold Plated Thick Hoop Earrings. These stunning earrings are the perfect accessory for weddings and parties, adding a touch of elegance and sophistication to any outfit. Crafted from durable Stainless Steel, these wide chunky CC hoops are plated in luxurious PVD gold, ensuring they will last for years to come.\n\nThe unique geometric design of these earrings sets them apart from traditional hoop earrings, making them a standout piece in any jewelry collection. The thick width of the hoops adds a touch of modern flair, while the gold plating gives them a classic, timeless appeal. Whether you're dressing up for a special occasion or simply want to add a touch of glamour to your everyday look, these earrings are the perfect choice.\n\nNot only are these earrings stylish and eye-catching, but they are also incredibly versatile. Pair them with a little black dress for a chic evening look, or wear them with a casual outfit to add a touch of elegance. The secure closure ensures that they will stay in place all day or night, so you can focus on enjoying yourself without worrying about your jewelry.\n\nWith their high-quality construction and attention-grabbing design, these Geometric PVD Gold Plated Thick Hoop Earrings are sure to become a favorite in your jewelry collection. Treat yourself to a pair today, or surprise a loved one with a special gift that they will treasure for years to come. Make a statement with these stunning earrings and step into the spotlight with confidence.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hed8ff8eda81f415fadbab89e4165c290w.jpg_100x100.jpg","Total Quantity":"2","Current Quantity":"","stock change":"Sergio to confirm -1 Glebe","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.62","Unit price":"USD 1.7600","Total":"USD 3.52","Ready":""},{"Spec/Specs":"JDNW2303019","Price(AUD)":"$39.00","Product summary":"Minimalist 18K Gold Plated Tassel Spine Choker Necklace Stainless Steel Fishbone Chain Necklace Bracelet Women","Product name":"Clovelly Beach Necklace","product description":"Embrace the beauty of minimalism with the stunning Clovelly Beach Necklace from our Ocean Collection. This stainless steel masterpiece features a sleek Fishbone design that exudes elegance and sophistication. Perfect for those who appreciate refined simplicity, this necklace is a versatile addition to any jewelry collection.\n\nCrafted from high-quality stainless steel, the Clovelly Beach Necklace is hypoallergenic, waterproof, and free from nickel and tarnish. This means you can wear it with confidence and ease, knowing it will withstand the test of time. The Fishbone design adds a unique touch to the piece, making it a standout accessory for any outfit.\n\nWhether you're heading to the beach or out for a night on the town, the Clovelly Beach Necklace is the perfect choice. Its minimalist design pairs well with both casual and formal attire, adding a touch of sophistication to any look. Plus, its durable construction means you can wear it every day without worry.\n\nThis necklace is a must-have for anyone who loves simple, elegant jewelry. Its timeless design will never go out of style, making it a versatile piece that you'll reach for again and again. Add the Clovelly Beach Necklace to your collection today and experience the beauty of minimalism.\n\nIn addition, this necklace is available in a gold plated option for those who prefer a touch of luxury. The gold plating adds a radiant shine to the piece, elevating its elegance even further. Treat yourself or a loved one to the Clovelly Beach Necklace in gold plated for a truly special gift.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Ha14f56ed5c5d4d63b4d26b15ea1e142cy.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 glede","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"2.67","Unit price":"USD 1.7900","Total":"USD 10.74","Ready":"Yes"},{"Spec/Specs":"JDB201496","Price(AUD)":"$39.00","Product summary":"Luxury 18K Gold Plated Stainless Steel Glass Pearl Bracelet","Product name":"Sofia's Pearl Splendor","product description":"Elevate your wrist with our Luxury 18K Gold Plated Stainless Steel Jewelry Gift Bead Chain Glass Pearl Bracelet. This stunning piece combines the classic elegance of glass pearls with a modern twist of gold plating, making it the perfect accessory for women who appreciate timeless style.\n\nCrafted from high-quality stainless steel and plated with 18K gold, this bracelet exudes luxury and sophistication. The bead chain design adds a touch of uniqueness to the piece, making it a standout addition to any ensemble.\n\nWhether you're dressing up for a special occasion or simply want to add a touch of glamour to your everyday look, this bracelet is the perfect choice. It can be worn alone for a chic and minimalist style, or layered with other bracelets for a more statement look.\n\nThis bracelet also makes for a great gift for a loved one or a special treat for yourself. The timeless design ensures that it will be cherished for years to come, making it a thoughtful and meaningful gift.\n\nAvailable in a range of sizes to ensure the perfect fit, this bracelet is a versatile piece that can be worn on its own or stacked with other jewelry. Don't miss out on adding this exquisite piece to your collection.\n\nExperience the beauty and elegance of our Luxury 18K Gold Plated Stainless Steel Jewelry Gift Bead Chain Glass Pearl Bracelet. Shop now to view our collection and find the right piece for you.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H97fb4d1a1b134241ba7f92f084626f07m.jpg_100x100.jpg","Total Quantity":"2","Current Quantity":"2","stock change":"","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"3.32","Unit price":"USD 2.2300","Total":"USD 4.46","Ready":""},{"Spec/Specs":"Bracelet one pearl","Price(AUD)":"$39.00","Product summary":"INS 18k Gold Plated Stainless Steel Figaro Chain Bracelets For Women Freshwater Baroque Pearl Bracelet","Product name":"Suzy Bracelet","product description":"Add a touch of elegance to your wrist with our INS 18k Gold Plated Stainless Steel Figaro Chain Bracelet. This versatile and timeless piece is perfect for daily wear or special occasions, making it a must-have in your jewelry collection. The high-quality gold plating gives it a luxurious look that will elevate any outfit.\n\nFor a classic and sophisticated look, consider pairing the Figaro Chain Bracelet with our Freshwater Baroque Pearl Bracelet. The Baroque pearls add a touch of uniqueness and charm to the bracelet, making it a standout piece in your collection. Whether you're dressing up for a special event or simply adding a touch of elegance to your everyday look, this bracelet is the perfect choice.\n\nOur gold plated jewelry is made with care and attention to detail, ensuring a high-quality finish that will last for years to come. The Figaro Chain Bracelet is available in a range of sizes to ensure the perfect fit for your wrist. Whether you're shopping for yourself or looking for the perfect gift for a loved one, our INS 18k Gold Plated Stainless Steel Figaro Chain Bracelet is the right choice.\n\nShop now to view our full range of gold plated jewelry, including earrings, necklaces, anklets, and more. Treat yourself or someone special to the gift of timeless elegance with our gold plated accessories. Don't miss out on our sale prices and find the perfect gold plated piece for your collection today.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H6a092d8909bf49a0b6444a4019eb71d6s.jpg_100x100.jpg","Total Quantity":"2","Current Quantity":"2","stock change":"","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"3.34","Unit price":"USD 2.2400","Total":"USD 4.48","Ready":""},{"Spec/Specs":"JDWB2302004","Price(AUD)":"$39.00","Product summary":"18K Gold Plated Stainless Steel Bracelet Jewelry Set Charm Natural Stone Choker Necklace Set for Women","Product name":"Palm Beach Bracelet","product description":"Elevate your wrist with the stunning Palm Beach Bracelet from our Ocean Collection. This stainless steel piece features a striking natural stone that adds a touch of natural allure to any ensemble. The bracelet is a statement of simplicity and sophistication, perfect for both casual and formal occasions.\n\nCrafted from hypoallergenic stainless steel, the Palm Beach Bracelet is waterproof and free from nickel and tarnish. This means you can wear it with confidence and comfort, knowing it won't irritate your skin or lose its shine over time. The durable construction ensures that this bracelet will be a lasting addition to your jewelry collection.\n\nThe natural stone featured on the Palm Beach Bracelet adds a unique and elegant touch to the design. Whether you choose a vibrant turquoise, a deep lapis lazuli, or a shimmering mother of pearl, each stone is carefully selected for its beauty and quality. The combination of the stone and stainless steel creates a striking contrast that is sure to catch the eye.\n\nFor a complete look, pair the Palm Beach Bracelet with other pieces from our Ocean Collection, such as a matching necklace or earrings. The versatility of this bracelet makes it a perfect accessory for any outfit, whether you're dressing up for a special occasion or adding a touch of elegance to your everyday look.\n\nAdd a touch of natural allure to your ensemble with the Palm Beach Bracelet. Shop now to find the perfect gold plated bracelet for yourself or as a thoughtful gift for someone special.","Product Image":"#REF!","Product image url":"https://s.alicdn.com/@sc04/kf/H61426005c81b40d48dd7b7c59b5d67b8V.jpg_960x960.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"3.32","Unit price":"2.23","Total":"","Ready":"Yes"},{"Spec/Specs":"JDEW2307050-1","Price(AUD)":"$44.00","Product summary":"Bead Chain Pearl Pendant Tassel Earring 18K PVD Gold Plated Stainless Steel","Product name":"Naty's Opulent Dream Earrings","product description":"Elevate your style with our stunning Bead Chain Tassel Elegance earrings, a perfect blend of fashion and functionality. Crafted from 18k PVD gold-plated stainless steel, these earrings are not only durable but also hypoallergenic and waterproof, making them ideal for everyday wear. The pearl pendant and tassel detail add a touch of glamour to these elegant accessories, perfect for any occasion.\n\nThe impeccable craftsmanship of these earrings showcases the attention to detail put into every piece, ensuring a high-quality finish that will last for years to come. The versatile design of the Bead Chain Tassel Elegance earrings makes them a must-have addition to any jewelry collection, offering a sophisticated and comfortable option for the modern woman.\n\nWhether you're dressing up for a special event or simply adding a touch of elegance to your everyday look, these earrings are the perfect choice. The gold-plated finish adds a touch of luxury, while the bead chain tassel design offers a unique and stylish twist. Embrace the beauty of these earrings and discover the allure of owning a piece of jewelry that effortlessly combines style and practicality.\n\nDon't miss out on the opportunity to own these Bead Chain Tassel Elegance earrings. Shop now and treat yourself or a loved one to the gift of timeless elegance. These earrings are the perfect accessory for any outfit, adding a touch of sophistication and charm. Make a statement with these stunning earrings and elevate your look to new heights.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H214d4b22d7254f7b98601471f60d51bfM.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"4","stock change":"-1 Natalia -1 Glebe","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"3.99","Unit price":"USD 2.6800","Total":"USD 16.08","Ready":""},{"Spec/Specs":"JDE202257-BE","Price(AUD)":"$44.00","Product summary":"18k Gold Plated Turquoise Hollow Evil Eyes Tarnish Free Stainless Steel Drop Earrings For Gift","Product name":"Turquoise Evil Eyes Drops","product description":"Add a touch of protection and style to your outfit with our Turquoise Evil Eyes Drops - 18k gold-plated earrings. These stunning earrings are crafted from stainless steel, ensuring durability and tarnish resistance. The unique design features hollow evil eyes with turquoise accents, perfect for warding off negativity and adding a touch of mystique to your look.\n\nThe gold-plated stainless steel construction of these earrings makes them a versatile and stylish choice for women who want to make a bold statement with their accessories. The 18k gold plating adds a touch of luxury and elegance to the design, making them perfect for both casual and formal occasions.\n\nWhether you're looking for the perfect pair of earrings for a night out or just want to add a touch of glamour to your everyday look, these Turquoise Evil Eyes Drops are sure to impress. The versatile design makes them easy to mix and match with other jewelry pieces, while the turquoise accents add a pop of color to your ensemble.\n\nElevate your style and protect yourself from negativity with these eye-catching earrings. Shop now to add these stunning gold-plated earrings to your jewelry collection and make a statement wherever you go. Perfect for gifting or treating yourself, these earrings are a must-have accessory for any fashion-forward woman.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H4ae14f1b6646449f92d826a7ba59bfe2l.jpg_100x100.jpg","Total Quantity":"4","Current Quantity":"3","stock change":"-1 Glebe","Unit":"Pieces","collection":"","published":"","Unit price AUD":"3.32","Unit price":"USD 2.2300","Total":"USD 8.92","Ready":""},{"Spec/Specs":"JDE201867-GN","Price(AUD)":"$44.00","Product summary":"18K Gold Plated Stainless Steel Green Cubic ZirconiaJewelry CC Shaped Twist Earrings for women","Product name":"CC Shaped Twist Earrings","product description":"Make a bold statement with our CC Shaped Twist Earrings, the perfect gold plated earrings for adding a touch of glamour to any outfit. Crafted from high-quality 18k gold-plated stainless steel, these earrings feature stunning green cubic zirconia stones that catch the light beautifully.\n\nThe unique twist design of these earrings adds a modern and stylish flair, making them the perfect accessory for women who want to showcase their individual sense of style. Whether you're dressing up for a special occasion or just adding a touch of elegance to your everyday look, these earrings are sure to turn heads.\n\nNot only are these earrings fashionable, but they are also practical. The waterproof feature ensures longevity, so you can wear them with confidence wherever you go. Plus, the secure closure means you can wear them all day without worrying about them slipping off.\n\nThese CC Shaped Twist Earrings are the perfect addition to any jewelry collection, whether you're a fan of gold plated jewelry or just looking for a versatile pair of earrings to elevate your style. Treat yourself or surprise a loved one with these chic and fashionable earrings that are sure to make a statement.\n\nDon't miss out on the opportunity to add these stunning earrings to your collection. Shop now and unleash your style with our CC Shaped Twist Earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H97766a9aff3241148f1f3edee3655134Z.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"4.72","Unit price":"USD 3.1700","Total":"USD 19.02","Ready":""},{"Spec/Specs":"Opal","Price(AUD)":"$44.00","Product summary":"New Trend Lapis Jade Opal Freshwater Pearl Huggie Earrings semi-precious stone Hoop Earring","Product name":"Opal Essence Huggies","product description":"Elevate your style with our stunning Lapis Jade Opal Freshwater Pearl Huggie Earrings, the latest trend in jewelry fashion. These hoop earrings are adorned with semi-precious stones, creating a perfect blend of elegance and bohemian charm. The unique combination of colors and textures makes these earrings a must-have accessory for anyone looking to add a touch of nature's beauty to their daily look.\n\nCrafted with care and attention to detail, these earrings are the perfect choice for those who appreciate high-quality jewelry with a touch of sophistication. The gold plating adds a luxurious touch to the design, making these earrings stand out from the crowd. Whether you're dressing up for a special occasion or simply want to add a touch of glamour to your everyday style, these earrings are sure to make a statement.\n\nIn addition to their beautiful design, these Lapis Jade Opal Freshwater Pearl Huggie Earrings are also versatile and easy to wear. The huggie style is comfortable and secure, ensuring that you can enjoy wearing these earrings all day long. Whether you're heading to the office, meeting friends for brunch, or going out for a night on the town, these earrings will complement any outfit.\n\nDon't miss out on the opportunity to add these stunning earrings to your jewelry collection. Treat yourself or surprise a loved one with a gift that is sure to be cherished. Shop now and experience the beauty and elegance of our Lapis Jade Opal Freshwater Pearl Huggie Earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H0feee0f6bde048c0a93a392e420322eav.jpg_100x100.jpg","Total Quantity":"1","Current Quantity":"1","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.97","Unit price":"USD 1.9900","Total":"USD 1.99","Ready":""},{"Spec/Specs":"Rose Quartz","Price(AUD)":"$44.00","Product summary":"New Trend Lapis Jade Opal Freshwater Pearl Huggie Earrings semi-precious stone Hoop Earring","Product name":"Gemstone Serenity Huggies","product description":"Introducing our stunning Rose Quartz Huggie Earrings, the latest trend in semi-precious stone jewelry. These beautiful hoop earrings are adorned with Lapis, Jade, Opal, and Freshwater Pearl, adding a touch of serenity and elegance to any outfit.\n\nCrafted with care and attention to detail, these earrings are perfect for those who love to make a statement with their accessories. The combination of the soft pink Rose Quartz and the vibrant colors of the other stones creates a unique and eye-catching look that is sure to turn heads.\n\nEach earring is carefully plated in gold, adding a touch of luxury and sophistication to the design. The gold plating not only enhances the beauty of the stones but also ensures that these earrings will last for years to come.\n\nThese Rose Quartz Huggie Earrings are versatile enough to be worn with both casual and formal attire, making them a must-have addition to any jewelry collection. Whether you're heading to a day at the office or a night out on the town, these earrings will add the perfect finishing touch to your look.\n\nTreat yourself to a pair of our Rose Quartz Huggie Earrings today, or surprise a loved one with a thoughtful and stylish gift. With their timeless design and high-quality craftsmanship, these earrings are sure to be a cherished piece in any jewelry lover's collection.\n\nDon't miss out on the opportunity to own a pair of these gorgeous earrings. Shop now to view our full collection of gold-plated jewelry and find the perfect piece to complement your style.","Product Image":"#REF!","Product image url":"https://s.alicdn.com/@sc04/kf/Ha694b045d6eb4648bed44233e3524658Q.jpg_720x720q50.jpg","Total Quantity":"1","Current Quantity":"1","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.97","Unit price":"1.99","Total":"","Ready":""},{"Spec/Specs":"JDE202024","Price(AUD)":"$44.00","Product summary":"Vintage Red And Blue Round Bead Pendant Hoop Earrings 18K Gold Stainless Steel For Women's Earrings 2022","Product name":"Vintage Bead Pendant Earrings","product description":"Step back in time with our Vintage Bead Pendant Earrings, a stunning piece of jewelry that will transport you to another era. These 18k gold stainless steel hoop earrings feature red and blue round bead pendants that exude a sense of nostalgia and charm. The vintage design adds a unique touch to any ensemble, making these earrings a standout accessory for 2022.\n\nElevate your style with these vintage-inspired earrings that are perfect for women who appreciate the timeless beauty of classic accessories. The combination of the gold-plated hoops and colorful bead pendants creates a striking contrast that will catch the eye of everyone around you. Whether you're dressing up for a special occasion or adding a touch of retro flair to your everyday look, these earrings are sure to make a statement.\n\nThese Vintage Bead Pendant Earrings are a versatile addition to any jewelry collection, offering a stylish and elegant option for any outfit. The 18k gold plating adds a touch of luxury to the design, while the red and blue beads bring a pop of color that will brighten up any look. Whether you're a fan of hoop earrings or prefer stud earrings, these Vintage Bead Pendant Earrings are the perfect choice.\n\nDon't miss out on the opportunity to own a piece of vintage-inspired jewelry that will set you apart from the crowd. Treat yourself to these gorgeous earrings or surprise a loved one with a unique and stylish gift. Shop now and add a touch of retro charm to your wardrobe with our Vintage Bead Pendant Earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H98dd65eb6f9246ff907d2627c4138b66E.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"4.22","Unit price":"USD 2.8300","Total":"USD 16.98","Ready":""},{"Spec/Specs":"JDN20672","Price(AUD)":"$44.00","Product summary":"Dainty PVD 18K Gold Plated Twisted Rope Unisex Chain Necklace Hip Pop Custom Jewelry For Daily","Product name":"Twisted Rope Charm","product description":"Elevate your daily style with our Dainty PVD 18K Gold Plated Twisted Rope Unisex Chain Necklace. This hip-hop custom jewelry piece is the perfect addition to your everyday wardrobe, effortlessly adding a touch of glamour to any look. \n\nCrafted with precision and attention to detail, this versatile necklace is a must-have accessory that complements any style. The 18K gold plating gives it a luxurious and timeless appeal, making it a standout piece in your jewelry collection.\n\nWhether you're dressing up for a special occasion or simply want to add some flair to your casual outfits, this gold plated necklace is the perfect choice. Its twisted rope design adds a unique touch, making it a statement piece that will turn heads wherever you go.\n\nPair it with your favorite hoop earrings or stud earrings for a complete and coordinated look. The unisex design makes it suitable for anyone looking to add a touch of sophistication to their ensemble.\n\nTreat yourself or a loved one to this exquisite piece of gold plated jewelry. It also makes a thoughtful gift for birthdays, anniversaries, or any special occasion. Shop now and add this stunning necklace to your collection.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H28e00186d0954677a8f557a1931319e6L.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Kai bought one","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.88","Unit price":"USD 1.9300","Total":"USD 11.58","Ready":""},{"Spec/Specs":"JDBW2306016","Price(AUD)":"$44.00","Product summary":"J&D Luxury 18K Gold Plated Earrings Stainless Steel Evil Turquoise Pearl Dangle Earrings Jewelry Women","Product name":"Evil Turquoise Dangles","product description":"Elevate your jewelry collection with our stunning J&D Luxury 18K Gold Plated Evil Turquoise Pearl Dangle Earrings. These exquisite earrings are crafted with high-quality stainless steel and gold plating, ensuring durability and a luxurious finish.\n\nThe Evil Turquoise Pearl Dangle Earrings feature a unique design that exudes elegance and charm. The evil eye motif, combined with the turquoise pearl dangle, creates a bold and eye-catching look that is perfect for women who love to stand out in any crowd.\n\nWhether you're dressing up for a special occasion or simply want to add a touch of sophistication to your everyday look, these earrings are the perfect choice. The 18K gold plating adds a luxurious touch to the earrings, making them a timeless addition to your jewelry collection.\n\nAt the perfect size, these earrings are comfortable to wear all day long. The secure closure ensures that they stay in place, so you can wear them with confidence. Whether you're wearing them with a casual outfit or a formal gown, these earrings will add a touch of glamour to any ensemble.\n\nTreat yourself or a loved one to these beautiful earrings as a gift. The Evil Turquoise Pearl Dangle Earrings come in a stylish gift box, making them the perfect present for any occasion. Shop now and add a touch of luxury to your jewelry collection with these exquisite earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H31023bd9c1c44b5d9fffd0790c919d0a0.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Glebe","Unit":"Pieces","collection":"","published":"","Unit price AUD":"2.88","Unit price":"USD 1.9300","Total":"USD 11.58","Ready":""},{"Spec/Specs":"JDE201584","Price(AUD)":"$49.00","Product summary":"18k Gold Plated Stainless Steel Party Jewelry Freshwater Pearl Huggie Earrings","Product name":"Mary's Enchanted Pearls","product description":"Elevate your party look with our stunning Pearl Bliss Huggies, the perfect addition to your collection of gold-plated earrings. Crafted with 18k gold-plated stainless steel and adorned with freshwater pearl pendants, these earrings exude elegance and sophistication.\n\nDesigned for women who appreciate timeless beauty in their accessories, these waterproof huggie earrings are versatile enough to be worn for any occasion. The secure fit of the huggie style ensures that they stay in place all day or night, making them a must-have accessory.\n\nStand out and shine bright with these exquisite pearl huggie earrings that effortlessly elevate your fashion-forward style. The combination of gold plating and freshwater pearls creates a luxurious look that is sure to turn heads wherever you go.\n\nWhether you're looking for the perfect gold-plated earrings for yourself or searching for a thoughtful gift for a loved one, these Pearl Bliss Huggies are the right choice. Their classic design and high-quality materials make them a timeless addition to any jewelry collection.\n\nDon't miss out on the opportunity to add these elegant earrings to your accessories. Shop now to view our full collection of gold-plated jewelry, including earrings, necklaces, bracelets, and more. Make a statement with our Pearl Bliss Huggies and experience the luxury of wearing high-quality, stylish jewelry.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hebdd248c30d541f69e8bd6a83995485cA.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"4.44","Unit price":"USD 2.9800","Total":"USD 17.88","Ready":""},{"Spec/Specs":"JDE202156","Price(AUD)":"$49.00","Product summary":"Twist Series Stainless Steel Earrings Fashion Waterproof 18K Pvd Gold Plated Earrings For Women","Product name":"Twist Series Fashion","product description":"Elevate your style effortlessly with the stunning Clovelly Beach Shell Earring from our Ocean Collection. This exquisite piece of gold plated jewelry captures the essence of Sydney's pristine beaches with its delicately crafted shell design. Plated in 18K gold, this earring exudes a touch of opulence that is sure to turn heads.\n\nCrafted from high-quality stainless steel, this earring is not only stylish but also hypoallergenic, waterproof, and nickel-free, making it suitable for everyday wear. The timeless design of the shell adds a touch of elegance to any outfit, whether you're heading to the beach or a night out on the town.\n\nThe Clovelly Beach Shell Earring is the perfect accessory to add to your collection of gold plated earrings. Its versatility allows you to pair it with other pieces of jewelry, such as gold plated necklaces or bracelets, for a complete and cohesive look. Whether you prefer hoop earrings or stud earrings, this piece is a must-have for any jewelry lover.\n\nTreat yourself or a loved one to this beautiful earring, which also makes a thoughtful gift for any occasion. With its unique design and impeccable craftsmanship, the Clovelly Beach Shell Earring is a timeless piece that will be cherished for years to come.\n\nElevate your style with the Clovelly Beach Shell Earring today and experience the beauty of Sydney's beaches wherever you go. Shop now to add this stunning piece to your jewelry collection.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H47dae09406154f8d9a84321fbb0947a5C.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"5.51","Unit price":"USD 3.7000","Total":"USD 22.20","Ready":""},{"Spec/Specs":"JDEW2306037-BL","Price(AUD)":"$49.00","Product summary":"J&D Chunky Jewelry Stainless Steel Enamel Eye Hoop Earring 18K Gold Plated Pearl Blue Devil's Eye Drop Earrings","Product name":"Blue Devil's Eye Drops","product description":"Channel your inner diva with J&D Chunky Jewelry's Blue Devil's Eye Drops earrings. These stunning statement earrings feature a unique design with stainless steel enamel eye hoops, 18k gold plating, and pearl blue devil's eye drops. The combination of bold colors and chunky style make these earrings perfect for adding a touch of glamour to any outfit.\n\nThe Blue Devil's Eye Drops earrings are the perfect accessory for those who want to make a statement. The gold plating adds a luxurious touch, while the eye-catching blue devil's eye drops bring a pop of color to your look. Whether you're dressing up for a special occasion or just want to add some flair to your everyday style, these earrings are sure to turn heads.\n\nMade with high-quality materials, these earrings are not only stylish but also durable. The hoop design adds a trendy touch, while the pearl blue devil's eye drops give them a unique and edgy look. These earrings are versatile enough to be worn with both casual and formal outfits, making them a must-have addition to your jewelry collection.\n\nWhether you're treating yourself or looking for the perfect gift for a friend, the Blue Devil's Eye Drops earrings are the right choice. Their eye-catching design and high-quality construction make them a standout piece of jewelry that will elevate any look. Don't miss out on the chance to add these gorgeous earrings to your collection. Shop now and make a bold statement with J&D Chunky Jewelry's Blue Devil's Eye Drops earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H6bac56613e9a44a786e88a99e5f6840aN.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"4","stock change":"-1 broken -1 Glebe","Unit":"Pieces","collection":"","published":"","Unit price AUD":"3.49","Unit price":"USD 2.3400","Total":"USD 14.04","Ready":""},{"Spec/Specs":"JDNW2307016","Price(AUD)":"$49.00","Product summary":"J&D Jewelry Ocean Series 18K Gold Plated Stainless Steel Starfish Chunky Pendant Necklace for Girls","Product name":"Coogee Beach Necklace","product description":"Elevate your look with the stunning Coogee Beach Necklace featuring a Starfish Pendant. Made from high-quality stainless steel, this necklace exudes elegance and charm. The starfish pendant symbolizes the beauty of the ocean, adding a touch of marine grace to your ensemble. \n\nThis piece is hypoallergenic, waterproof, and nickel and tarnish-free, making it perfect for everyday wear. The timeless design effortlessly complements any outfit, whether you're heading to the beach or a night out on the town. \n\nThe Coogee Beach Necklace is a must-have for those who love the allure of the ocean and want to add a touch of sophistication to their style. With its durable construction and timeless beauty, this necklace is sure to become a staple in your jewelry collection.\n\nWhether you're looking for the perfect gift for a loved one or treating yourself to something special, the Coogee Beach Necklace is the right choice. Shop now and embrace the beauty of the sea with this exquisite piece of jewelry. Don't miss out on this timeless accessory that will add a touch of elegance to any outfit.\n\nIn summary, the Coogee Beach Necklace with a Starfish Pendant is a stunning piece of jewelry that combines the beauty of the ocean with timeless sophistication. Its high-quality stainless steel construction and hypoallergenic, waterproof properties make it the perfect accessory for any occasion. Add this necklace to your collection today and enjoy its beauty for years to come.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H4d25597de0384baf9dcb1b76799369bfo.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Mary","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"2.55","Unit price":"USD 1.7100","Total":"USD 10.26","Ready":"Yes"},{"Spec/Specs":"JDNW2307015","Price(AUD)":"$49.00","Product summary":"J&D Tarnish Free Stainless Steel Gold Plated Fashion Jewelry Shell Necklaces For Women Moissanite Gold Necklace","Product name":"Bondi Beach Necklace","product description":"Indulge in luxury with our exquisite Bondi Beach Necklace. This stunning piece features a dazzling moissanite stone set in gold plated jewelry, adding a touch of opulence to any outfit. Whether you're dressing up for a special occasion or simply want to elevate your everyday style, this necklace is the perfect choice.\n\nThe Bondi Beach Necklace is the epitome of chic and sophistication, making it a must-have accessory for any fashion-forward individual. The intricate design and high-quality craftsmanship of this gold plated necklace will surely make a statement wherever you go.\n\nThis versatile piece can be worn on its own for a minimalist look or layered with other gold plated necklaces for a more dramatic effect. The adjustable chain necklace ensures the perfect fit for any neckline, making it suitable for all occasions.\n\nElevate your jewelry collection with the Bondi Beach Necklace and experience the luxury of gold plated jewelry. Treat yourself or surprise a loved one with this timeless piece that will be treasured for years to come. Shop now and add a touch of glamour to your ensemble.\n\nDon't miss out on the opportunity to own the perfect gold plated necklace. Enhance your style with this elegant accessory that exudes sophistication and class. View our collection today and find the right piece for you.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H02ed3fd780834ccdb48daba805169545g.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"2.88","Unit price":"USD 1.9300","Total":"USD 11.58","Ready":"Yes"},{"Spec/Specs":"Bracelet pearl","Price(AUD)":"$49.00","Product summary":"18K Gold Plated Stainless Steel Baroque Freshwater Pearl Rectangular Link Chain Bracelet","Product name":"Paloma's Timeless Baroque Link","product description":"Elevate your style with our exquisite 18K Gold Plated Stainless Steel Baroque Freshwater Pearl Bracelet. This stunning piece features a rectangular link chain design that exudes timeless elegance and sophistication. Whether you're dressing up for a special occasion or adding a touch of class to your everyday look, this bracelet is the perfect accessory to complement any outfit.\n\nCrafted with high-quality materials, this gold plated bracelet is a symbol of classic charm. The lustrous freshwater pearl adds a touch of luxury to the piece, making it a standout accessory in your jewelry collection. The gold plating on the stainless steel chain ensures durability and long-lasting shine, making this bracelet a worthwhile investment.\n\nThis versatile piece is perfect for layering with other bracelets or wearing on its own for a minimalist look. The adjustable length ensures a comfortable fit for any wrist size, making it a great gift option for a loved one or as a treat for yourself.\n\nAdd a touch of sophistication to your ensemble with our 18K Gold Plated Stainless Steel Baroque Freshwater Pearl Bracelet. Shop now and elevate your style with this classic piece of jewelry.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hf2107765a5e94fdeaa7acf82238ec89dR.jpg_100x100.jpg","Total Quantity":"2","Current Quantity":"2","stock change":"","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"5.08","Unit price":"USD 3.4100","Total":"USD 6.82","Ready":""},{"Spec/Specs":"JDB2303002","Price(AUD)":"$49.00","Product summary":"Stainless Steel 18K Gold Heart beaded Bracelet for Girls Women","Product name":"Heart Beaded Elegance","product description":"Add a touch of romance and sophistication to your look with our Stainless Steel 18K Gold Heart Beaded Bracelet. This stunning piece of gold plated jewelry is the perfect accessory for girls and women of all ages. The heart-shaped beads add a charming touch to the modern design, making it a timeless addition to any jewelry collection.\n\nCrafted from high-quality stainless steel and plated with 18K gold, this bracelet is not only beautiful but also durable and long-lasting. The gold plating gives it a luxurious shine that will catch the light and draw attention to your wrist. Whether you're dressing up for a special occasion or adding a touch of elegance to your everyday look, this bracelet is the perfect choice.\n\nThe adjustable size ensures a comfortable fit for any wrist, and the secure clasp keeps it in place all day long. Pair it with our matching gold plated necklace for a coordinated look, or wear it on its own for a subtle yet stylish statement. This bracelet is also a great gift for a loved one, symbolizing your affection and appreciation.\n\nShop now and add this perfect gold plated bracelet to your jewelry collection. Whether you're treating yourself or looking for the right gift for someone special, this bracelet is sure to impress. Embrace love and elegance with our Stainless Steel 18K Gold Heart Beaded Bracelet.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H5b6a21ae7f2946cc9f7d02e4ef9f7e9b7.jpg_100x100.jpg","Total Quantity":"2","Current Quantity":"1","stock change":"-1 Mary","Unit":"Pieces","collection":"","published":"","Unit price AUD":"4.63","Unit price":"USD 3.1100","Total":"USD 6.22","Ready":""},{"Spec/Specs":"JDE201886","Price(AUD)":"$49.00","Product summary":"Dropshipping Geometric PVD Gold Plated Thick Hoop Earrings Wedding Stainless Steel Wide Chunky CC Hoop Earrings for Women","Product name":"Golden Embrace Hoops","product description":"Make a bold statement with our Dropshipping Geometric Hoop Earrings. These thick, PVD gold-plated stainless steel hoops are designed for weddings and beyond. The wide, chunky CC hoop style adds a touch of sophistication to any look.\n\nCrafted from high-quality stainless steel with a PVD gold plating, these earrings are perfect for those who want a luxurious yet affordable accessory. The geometric design of the hoops gives them a modern and edgy look, making them a versatile piece that can be dressed up or down.\n\nWhether you're attending a wedding, a fancy dinner, or just want to elevate your everyday outfit, these hoop earrings are the perfect choice. Their bold design will instantly add a touch of glamour to any ensemble, making you stand out from the crowd.\n\nPair these hoop earrings with a matching gold plated necklace or bracelet for a coordinated look that will impress everyone. The gold plating on these earrings ensures that they will retain their shine and color for years to come, making them a timeless addition to your jewelry collection.\n\nDon't miss out on the opportunity to own these stunning gold-plated hoop earrings. Shop now to get the perfect accessory for any occasion. Whether you're treating yourself or looking for a special gift for a loved one, these earrings are the right choice. Upgrade your jewelry game with these statement-making earrings today.","Product Image":"#REF!","Product image url":"https://s.alicdn.com/@sc04/kf/Hdcaab7b0b6b84dbdb3f67958364ddcfa7.jpg_960x960.jpg","Total Quantity":"2","Current Quantity":"2","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"4.44","Unit price":"2.98","Total":"","Ready":""},{"Spec/Specs":"Gold-Blue","Price(AUD)":"$56.00","Product summary":"INS Popular 18K Gold Plated Emerald Huggie Earring 925 Sterling Silver Green Waterdrop Zircon Earring","Product name":"Emerald Huggie Elegance","product description":"Elevate your style with the exquisite INS Popular Emerald Huggie Earrings. These stunning earrings feature 18k gold-plated stainless steel and a vibrant green waterdrop zircon, adding a touch of luxury to any ensemble. Crafted with precision from 925 sterling silver, these earrings are perfect for women who appreciate the fusion of sophistication and trendiness.\n\nThe unique design of the Emerald Huggie Earrings makes a bold statement, exuding glamour and elegance. The huggie style ensures a comfortable and secure fit, making them perfect for everyday wear or special occasions. Whether you're dressing up for a night out or adding a pop of color to your casual look, these earrings are sure to turn heads.\n\nThe INS Popular Emerald Huggie Earrings are the perfect addition to your jewelry collection. The gold-plated finish adds a touch of opulence, while the waterdrop zircon brings a pop of color and sparkle. These earrings can be paired with a matching necklace or bracelet for a coordinated look, or worn on their own for a subtle yet stylish statement.\n\nMake a statement with the INS Popular Emerald Huggie Earrings, the perfect gold-plated earrings for any occasion. Shop now and add a touch of glamour to your jewelry collection. View our full range of gold-plated jewelry and find the right piece for you. Treat yourself or a loved one to a stunning gift that will be cherished for years to come.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H741d9f1bdce1476982a37f02af50eda22.jpg_100x100.jpg","Total Quantity":"3","Current Quantity":"2","stock change":"-1 Sergio","Unit":"Pieces","collection":"ocean","published":"","Unit price AUD":"5.22","Unit price":"USD 3.5000","Total":"USD 10.50","Ready":"Yes"},{"Spec/Specs":"JDE2023297","Price(AUD)":"$56.00","Product summary":"High Polished Conch Pendant Sea Series 18K Gold Plated Stainless Steel Hoop Earrings Women Jewelry","Product name":"Bondi Beach Hoops","product description":"Step into the world of elegance with our Bondi Beach Hoops with Conch Pendant, a stunning addition to our Ocean Collection. These gold plated earrings are crafted from stainless steel, ensuring durability and beauty that lasts. The 18K gold plating adds a touch of luxury to these delicate hoops, making them perfect for any occasion.\n\nNot only are these earrings hypoallergenic, but they are also waterproof and nickel-free, providing both style and comfort for all-day wear. The timeless design of the hoops paired with the intricate conch pendant creates a look that is effortlessly chic and sophisticated.\n\nWhether you're dressing up for a special evening out or simply adding a touch of elegance to your everyday look, these Bondi Beach Hoops are the perfect choice. The versatility of these earrings makes them a must-have in any jewelry collection.\n\nWith the option to shop online, finding the perfect gold plated jewelry has never been easier. Treat yourself or a loved one to a timeless piece that will be cherished for years to come. Pair these earrings with a matching gold plated necklace or bracelet for a coordinated look that is sure to turn heads.\n\nDon't miss out on the opportunity to own these exquisite Bondi Beach Hoops with Conch Pendant. View our collection today and find the perfect gold plated earrings to elevate your style.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H9f7fbe40f2714991a9b5b57124030c12N.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"5.13","Unit price":"USD 3.4400","Total":"USD 20.64","Ready":"Yes"},{"Spec/Specs":"JDE201799","Price(AUD)":"$59.00","Product summary":"18k Gold Plated Stainless Steel Tassel Hoop Earrings with Small Pearls","Product name":"Julia's Radiant Tassel Hoops","product description":"Elevate your style with our Tassel Temptation Hoops, a stunning pair of 18k gold-plated earrings that exude timeless elegance. These hoop earrings are the perfect addition to your jewelry collection, combining durability with a touch of luxury. The waterproof small pearl tassels add a unique and sophisticated touch, making these earrings a versatile choice for any occasion.\n\nCrafted from hypoallergenic stainless steel, these Tassel Temptation Hoops are designed for comfort and longevity. Whether you're heading to the office or a night out on the town, these earrings effortlessly transition from day to night, making them a must-have accessory for any woman who appreciates classic beauty and modern design.\n\nMake a statement with these perfect gold plated earrings, a chic and stylish choice that will elevate any outfit. The versatility of these hoops makes them a go-to accessory for any look, adding a touch of glamour to your ensemble.\n\nTreat yourself or a loved one to the gift of luxury with our Tassel Temptation Hoops. Whether you're shopping for yourself or looking for the perfect gift, these earrings are sure to impress. Shop now and add a touch of sophistication to your jewelry collection with these stunning gold-plated hoop earrings.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hb1754629c5694d75b5d3890f4c7ba5a27.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"5.96","Unit price":"USD 4.0000","Total":"USD 24.00","Ready":""},{"Spec/Specs":"JDE201586","Price(AUD)":"$59.00","Product summary":"18k Gold Double Plated Pink Rhombus Natural Stone Pendant Stainless Steel Huggie Earrings For Women","Product name":"Pink Rhombus Huggies","product description":"Elevate your accessory game with our Pink Rhombus Huggies - 18k gold double-plated stainless steel earrings. These stunning earrings feature a natural stone pendant, adding a pop of color and elegance to any outfit. The huggie design ensures a secure fit, perfect for women on the go who want to stand out with their accessories.\n\nOur Pink Rhombus Huggies are not only stylish but also durable, making them the perfect addition to your jewelry collection. The 18k gold double-plating gives these earrings a luxurious look without the hefty price tag. The pink rhombus stone adds a touch of femininity and sophistication, making them the perfect choice for any occasion.\n\nWhether you're looking for the perfect gold plated earrings to elevate your everyday look or searching for a special gift for a loved one, our Pink Rhombus Huggies are the right choice. The unique design of these earrings will make you stand out from the crowd and add a touch of glamour to any outfit.\n\nDon't miss out on the opportunity to add these beautiful earrings to your jewelry collection. Shop now and treat yourself or a loved one to the perfect accessory that will elevate any look. With their durable construction and elegant design, our Pink Rhombus Huggies are the perfect choice for women who want to make a statement with their jewelry.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H22d3bbbc04eb4de2babf5b3f4a4f4a07l.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"4.99","Unit price":"USD 3.3500","Total":"USD 20.10","Ready":""},{"Spec/Specs":"JDWN2302003","Price(AUD)":"$59.00","Product summary":"18K Gold Plated Stainless Steel Bracelet Jewelry Set Charm Natural Stone Choker Necklace Set for Women","Product name":"Palm Beach Necklace","product description":"Introducing the Palm Beach Necklace, a stunning piece of jewelry crafted from high-quality stainless steel and adorned with natural stones. This exquisite necklace is designed to perfectly complement our popular Obelisk bracelet, creating a cohesive and stylish look for any occasion. The Palm Beach Necklace is the epitome of understated elegance, making it a must-have accessory for those who appreciate refined style.\n\nHypoallergenic and waterproof, this necklace is suitable for everyday wear and is nickel and tarnish-free, ensuring long-lasting beauty. The natural stones add a touch of sophistication and charm, making this necklace a versatile choice for both casual and formal outfits. The sleek design of the Palm Beach Necklace makes it a perfect match for those who prefer minimalist and classic jewelry pieces.\n\nWhether you're looking to treat yourself or find the perfect gift for a loved one, the Palm Beach Necklace is sure to impress. Its timeless design and durable construction make it a valuable addition to any jewelry collection. Pair it with our Obelisk bracelet for a coordinated look, or wear it on its own for a touch of natural beauty.\n\nExperience the allure of the Palm Beach Necklace and elevate your style with this exquisite piece of jewelry. Shop now and discover the beauty of gold plated jewelry at an affordable price. Don't miss out on this opportunity to add a touch of elegance to your look with the perfect gold plated necklace.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H608c98dc5efd4ab48664ce432b28966eX.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Glebe","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"6.21","Unit price":"USD 4.1700","Total":"USD 25.02","Ready":"Yes"},{"Spec/Specs":"JDNP791-1","Price(AUD)":"$59.00","Product summary":"Waterproof 18K Gold Plated Stainless Steel Double Layer Freshwater Pearl Choker Necklace","Product name":"Suzy's Dazzling Double Pearl Choker","product description":"Elevate your look with our Waterproof 18K Gold Plated Stainless Steel Necklace. The Double Layer Freshwater Pearl Choker Necklace is the epitome of sophistication and style. The luxurious 18K gold plating adds a touch of elegance, making this necklace perfect for any occasion.\n\nCrafted from high-quality stainless steel, this necklace is not only waterproof but also incredibly durable. The double layer design creates a modern and unique look, while the freshwater pearls add a classic touch. Whether you're dressing up for a special event or adding a touch of glamour to your everyday look, this necklace is sure to make a statement.\n\nThe timeless design of this necklace makes it a versatile piece that can be easily dressed up or down. Pair it with a little black dress for a night out, or wear it with a simple white t-shirt for a chic daytime look. The adjustable chain allows you to customize the fit to suit your style.\n\nThis Waterproof 18K Gold Plated Stainless Steel Necklace is the perfect choice for those who appreciate the combination of luxury and durability. Treat yourself or someone special to this stunning piece of jewelry that will last a lifetime. Shop now and add a touch of timeless elegance to your jewelry collection.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H86aaf21e2ea540a7b292a44251e2382dF.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"4","stock change":"-1 Natalia\r\n-1 Sergio sold one","Unit":"Pieces","collection":"pearl","published":"Yes","Unit price AUD":"6.08","Unit price":"USD 4.0800","Total":"USD 24.48","Ready":""},{"Spec/Specs":"JDN21078","Price(AUD)":"$59.00","Product summary":"Vintage 18K Gold Plated Paperclip Box Chain Layered Necklace Stainless Steel Triple Layer Necklace","Product name":"Triple Layered Vintage","product description":"Elevate your style effortlessly with the stunning Vintage 18K Gold Plated Paperclip Box Chain Layered Necklace. This exquisite piece is meticulously crafted with high-quality Stainless Steel, ensuring durability and longevity. The triple-layered design adds depth and dimension to your look, making it a versatile accessory for any occasion.\n\nThe radiant 18K gold plating exudes sophistication and charm, elevating your ensemble with a touch of luxury. Whether you're dressing up for a formal event or adding a touch of glamour to your everyday look, this timeless necklace is the perfect choice.\n\nMake a fashion statement that transcends trends with this elegant piece of gold plated jewelry. The classic paperclip box chain design adds a modern twist to a traditional style, creating a unique and eye-catching aesthetic. The necklace is designed to be layered, adding a chic and trendy touch to your outfit.\n\nThis gold plated necklace is the perfect addition to your jewelry collection, offering a touch of elegance and refinement to any look. The versatile design makes it easy to mix and match with other pieces in your collection, allowing you to create your own personalized style.\n\nWhether you're treating yourself or searching for the perfect gift, this Vintage 18K Gold Plated Paperclip Box Chain Layered Necklace is sure to impress. Shop now and elevate your style with this exquisite piece of jewelry that will never go out of style.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H86bbb723b2e44e809a4e97181b43df1ch.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"4","stock change":"-1 Broken\r\n-1 Mary","Unit":"Pieces","collection":"","published":"","Unit price AUD":"3.55","Unit price":"USD 2.3800","Total":"USD 14.28","Ready":""},{"Spec/Specs":"JDNW2306038","Price(AUD)":"$79.00","Product summary":"J&D Hot Style 18K Gold Plated Necklace Devil's Eye 3-layers Stainless Steel Women Jewelry Necklace","Product name":"Devil's Eye Necklace","product description":"Step into the spotlight with our J&D Hot Style 18K Gold Plated Necklace featuring Devil's Eye. The 3-layers Stainless Steel design adds an edge to your look. Embrace a touch of mystique and modernity with this eye-catching necklace. Perfect for those who dare to stand out in style.\n\nOur gold plated necklace is the perfect accessory to elevate any outfit. The intricate Devil's Eye design adds a unique and bold touch to your ensemble. Made with high-quality stainless steel and plated with 18K gold, this necklace is not only stylish but also durable.\n\nWhether you're dressing up for a special occasion or adding a statement piece to your everyday look, this necklace is sure to turn heads. The 3 layers of stainless steel create a dimensional and dynamic effect, making it a versatile piece that can be worn with a variety of outfits.\n\nThe Devil's Eye pendant is a symbol of mystery and intrigue, perfect for those who like to add a touch of edge to their style. The gold plating adds a luxurious touch, making this necklace a standout piece in your jewelry collection.\n\nMake a statement with our J&D Hot Style 18K Gold Plated Necklace and embrace your unique sense of style. Stand out from the crowd and show off your fashion-forward look with this eye-catching accessory. Add this necklace to your jewelry collection today and elevate your outfit to the next level.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H817b3435e3e64cf1b44552d365ae751cq.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"-","Unit":"Pieces","collection":"","published":"","Unit price AUD":"5.33","Unit price":"USD 3.5800","Total":"USD 21.48","Ready":""},{"Spec/Specs":"JDN2305038","Price(AUD)":"$79.00","Product summary":"New Arrival 18k Gold Plated White Fritillaria Heart Shape Necklace Stainless Steel Pendant for Women","Product name":"Fritillaria Heart Pendant","product description":"Add a touch of romance and elegance to your look with our stunning New Arrival 18k Gold Plated White Fritillaria Heart Shape Necklace. This beautiful necklace features a delicate heart-shaped pendant made of stainless steel, plated with luxurious 18k gold for a glamorous shine.\n\nWhether you're dressing up for a special occasion or simply adding a stylish accent to your daily ensemble, this necklace is the perfect choice. The intricate design of the Fritillaria flower adds a touch of sophistication and charm, making it a symbol of love and beauty.\n\nThe 18k gold plating gives this necklace a high-end look without the hefty price tag, making it a great option for those looking for affordable luxury. The white Fritillaria flower adds a touch of femininity and grace to the piece, making it a versatile accessory that can be paired with a variety of outfits.\n\nThis necklace is perfect for gifting to a loved one or treating yourself to a special piece of jewelry. The adjustable chain allows you to customize the length to suit your style, while the secure clasp ensures that your necklace stays in place all day long.\n\nFor a timeless and elegant piece that will never go out of style, look no further than our 18k Gold Plated White Fritillaria Heart Shape Necklace. Shop now to add this stunning piece to your jewelry collection and elevate your look to the next level.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H676af12f4db54f25b27c535826c41e8cy.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"3.56","Unit price":"USD 2.3900","Total":"USD 14.34","Ready":""},{"Spec/Specs":"JDEW2305028-GN","Price(AUD)":"$79.00","Product summary":"Fashion 18K Gold Plated Stainless Steel Turquoise Lapis Lazuli Natural Stones Beads Hoop Earring","Product name":"Palm Beach Earrings","product description":"Step into the world of luxury with our Palm Beach Earrings, a stunning addition to our Ocean Collection. These earrings are crafted with 18K gold-plated stainless steel, ensuring durability and a radiant finish that will last a lifetime. The combination of turquoise and lapis lazuli stones in these earrings perfectly captures the vibrant and captivating hues of the ocean, making them a true statement piece.\n\nNot only are these earrings beautiful, but they are also practical. They are hypoallergenic, making them suitable for even the most sensitive ears. Additionally, they are waterproof, so you can wear them with confidence whether you're at the beach or in the office. Say goodbye to tarnishing and nickel allergies with these high-quality earrings.\n\nThe Palm Beach Earrings are versatile and can be dressed up or down to suit any occasion. Whether you're heading to a formal event or simply running errands, these earrings will add a touch of elegance to any outfit. The combination of the gold plating and gemstones creates a timeless aesthetic that will never go out of style.\n\nTreat yourself or a loved one to the perfect gift with our Palm Beach Earrings. Their unique design and high-quality materials make them a standout piece in any jewelry collection. Make a splash with these earrings and elevate your style to new heights.\n\nExperience the beauty of the ocean with our Palm Beach Earrings. Shop now to add a touch of luxury to your look.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/H3eadee98de58407aaede0a1fb3586641m.jpg_100x100.jpg","Total Quantity":"6","Current Quantity":"5","stock change":"-1 Mary","Unit":"Pieces","collection":"ocean","published":"Yes","Unit price AUD":"5.77","Unit price":"USD 3.8700","Total":"USD 23.22","Ready":"Yes"},{"Spec/Specs":"JDE2023245-WT","Price(AUD)":"$79.00","Product summary":"Sparkle Micro Cubic Zircon Chunky Shiny 18k PVD Gold Plated Stainless Steel Hoop Earrings Huggie Jewelry","Product name":"Celestial Radiance Hoops","product description":"Experience the celestial allure with our Sparkle Micro Cubic Zircon Chunky Shiny Hoop Earrings. Made from 18k PVD Gold Plated Stainless Steel, these earrings bring a lasting brilliance to your jewelry collection. The chunky hoops are adorned with sparkling micro cubic zircon stones that catch the light with every movement, giving you a touch of glamour for any occasion.\n\nThese gold plated earrings are the perfect addition to your jewelry box, adding a touch of elegance to any outfit. The hoops are lightweight and comfortable to wear, making them perfect for all-day wear. Whether you're dressing up for a special event or adding a bit of sparkle to your everyday look, these earrings are sure to turn heads.\n\nOur Sparkle Micro Cubic Zircon Chunky Shiny Hoop Earrings are the perfect gift for yourself or a loved one. The timeless design and high-quality materials make them a versatile piece that will be cherished for years to come. Whether you're shopping for a birthday, anniversary, or just because, these earrings are a great choice.\n\nFor a touch of celestial allure, look no further than our Sparkle Micro Cubic Zircon Chunky Shiny Hoop Earrings. Shop now to add these stunning gold plated earrings to your collection and elevate your style to new heights.","Product Image":"#REF!","Product image url":"https://sc04.alicdn.com/kf/Hd9a86affa38743fdb6b529b419167f3dj.jpg","Total Quantity":"6","Current Quantity":"6","stock change":"","Unit":"Pieces","collection":"","published":"","Unit price AUD":"6.68","Unit price":"4.48","Total":"","Ready":""}]